; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=14, locations=14, max_capacity=2, out_folder=training/easy, instance_id=80, seed=121

(define (problem transport-80)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l3)
    (at p3 l14)
    (at p4 l11)
    (at p5 l7)
    (at p6 l1)
    (at p7 l11)
    (at p8 l12)
    (at p9 l14)
    (at p10 l13)
    (at p11 l14)
    (at p12 l10)
    (at p13 l7)
    (at p14 l13)
    (at v1 l3)
    (at v2 l1)
    (at v3 l8)
    (at v4 l7)
    (at v5 l14)
    (at v6 l13)
    (road l12 l4)
    (road l3 l1)
    (road l4 l12)
    (road l5 l13)
    (road l9 l5)
    (road l11 l2)
    (road l10 l6)
    (road l2 l5)
    (road l13 l5)
    (road l1 l3)
    (road l2 l11)
    (road l1 l9)
    (road l12 l9)
    (road l5 l9)
    (road l9 l1)
    (road l9 l7)
    (road l1 l8)
    (road l7 l9)
    (road l6 l10)
    (road l14 l5)
    (road l5 l2)
    (road l8 l1)
    (road l5 l14)
    (road l9 l12)
    (road l10 l1)
    (road l1 l10)
    (road l4 l5)
    (road l5 l4)
    (road l3 l14)
    (road l14 l3)
    (road l4 l10)
    (road l10 l4)
    (road l5 l6)
    (road l6 l5)
    (road l8 l11)
    (road l11 l8)
    (road l2 l9)
    (road l9 l2)
    (road l9 l11)
    (road l11 l9)
    (road l6 l12)
    (road l12 l6)
    (road l10 l13)
    (road l13 l10)
    (road l5 l10)
    (road l10 l5)
    (road l7 l14)
    (road l14 l7)
    (road l2 l3)
    (road l3 l2)
    (road l1 l14)
    (road l14 l1)
    (road l2 l4)
    (road l4 l2)
    (road l8 l9)
    (road l9 l8)
    (road l6 l9)
    (road l9 l6)
    (road l1 l5)
    (road l5 l1)
    (road l1 l6)
    (road l6 l1)
    (road l10 l12)
    (road l12 l10)
    (road l7 l8)
    (road l8 l7)
    (road l1 l7)
    (road l7 l1)
    (road l4 l9)
    (road l9 l4)
    (road l3 l7)
    (road l7 l3)
    (road l12 l14)
    (road l14 l12)
    (road l2 l14)
    (road l14 l2)
    (road l7 l10)
    (road l10 l7)
    (road l6 l8)
    (road l8 l6)
    (road l6 l13)
    (road l13 l6)
    (road l9 l10)
    (road l10 l9)
    (road l7 l12)
    (road l12 l7)
    (road l4 l7)
    (road l7 l4)
    (road l8 l13)
    (road l13 l8)
    (road l11 l13)
    (road l13 l11)
    (road l8 l12)
    (road l12 l8)
    (road l5 l12)
    (road l12 l5)
    (road l12 l13)
    (road l13 l12)
    (road l2 l12)
    (road l12 l2)
    (road l3 l5)
    (road l5 l3)
    (road l6 l7)
    (road l7 l6)
    (road l3 l13)
    (road l13 l3)
    (road l7 l13)
    (road l13 l7)
    (road l3 l6)
    (road l6 l3)
    (road l1 l11)
    (road l11 l1)
    (road l8 l14)
    (road l14 l8)
    (road l5 l11)
    (road l11 l5)
    (road l3 l9)
    (road l9 l3)
    (road l9 l14)
    (road l14 l9)
    (road l11 l14)
    (road l14 l11)
    (road l11 l12)
    (road l12 l11)
    (road l5 l7)
    (road l7 l5)
    (road l2 l8)
    (road l8 l2)
    (road l4 l13)
    (road l13 l4)
    (road l2 l7)
    (road l7 l2)
    (road l2 l10)
    (road l10 l2)
    (road l2 l6)
    (road l6 l2)
    (road l9 l13)
    (road l13 l9)
    (road l6 l14)
    (road l14 l6)
    (road l1 l13)
    (road l13 l1)
    (road l5 l8)
    (road l8 l5)
    (road l4 l14)
    (road l14 l4)
    (road l4 l11)
    (road l11 l4)
    (road l8 l10)
    (road l10 l8)
    (road l4 l6)
    (road l6 l4)
    (road l3 l10)
    (road l10 l3)
    (road l6 l11)
    (road l11 l6)
    (road l3 l11)
    (road l11 l3)
    (road l1 l2)
    (road l2 l1)
    (road l3 l8)
    (road l8 l3)
    (road l3 l12)
    (road l12 l3)
    (road l3 l4)
    (road l4 l3)
    (road l10 l11)
    (road l11 l10)
    (road l1 l12)
    (road l12 l1)
    (road l7 l11)
    (road l11 l7)
    (road l4 l8)
    (road l8 l4)
    (road l13 l14)
    (road l14 l13)
    (road l2 l13)
    (road l13 l2)
    (road l10 l14)
    (road l14 l10)
    )
 (:goal  (and 
    (at p1 l10)
    (at p2 l11)
    (at p3 l5)
    (at p4 l4)
    (at p5 l3)
    (at p6 l14)
    (at p7 l2)
    (at p8 l2)
    (at p9 l12)
    (at p10 l5)
    (at p11 l7)
    (at p12 l13)
    (at p13 l12)
    (at p14 l12))))

; plan
1. (drive v1 l3 l5)
   deleted: (at v1 l3)
   added: (at v1 l5)
   goals met: 0 of 14
2. (pick-up v1 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 14
3. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 0 of 14
4. (drop v1 l10 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l10) (capacity v1 c1)
   goals met: 1 of 14
5. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 1 of 14
6. (pick-up v1 l3 p2 c0 c1)
   deleted: (at p2 l3) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 14
7. (drive v1 l3 l11)
   deleted: (at v1 l3)
   added: (at v1 l11)
   goals met: 1 of 14
8. (drop v1 l11 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l11) (capacity v1 c1)
   goals met: 2 of 14
9. (drive v1 l11 l14)
   deleted: (at v1 l11)
   added: (at v1 l14)
   goals met: 2 of 14
10. (pick-up v1 l14 p3 c0 c1)
   deleted: (at p3 l14) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 14
11. (drive v1 l14 l5)
   deleted: (at v1 l14)
   added: (at v1 l5)
   goals met: 2 of 14
12. (drop v1 l5 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l5) (capacity v1 c1)
   goals met: 3 of 14
13. (drive v1 l5 l11)
   deleted: (at v1 l5)
   added: (at v1 l11)
   goals met: 3 of 14
14. (pick-up v1 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 14
15. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 3 of 14
16. (drop v1 l4 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l4) (capacity v1 c1)
   goals met: 4 of 14
17. (drive v1 l4 l7)
   deleted: (at v1 l4)
   added: (at v1 l7)
   goals met: 4 of 14
18. (pick-up v1 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 14
19. (drive v1 l7 l3)
   deleted: (at v1 l7)
   added: (at v1 l3)
   goals met: 4 of 14
20. (drop v1 l3 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l3) (capacity v1 c1)
   goals met: 5 of 14
21. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 5 of 14
22. (pick-up v1 l1 p6 c0 c1)
   deleted: (at p6 l1) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 14
23. (drive v1 l1 l14)
   deleted: (at v1 l1)
   added: (at v1 l14)
   goals met: 5 of 14
24. (drop v1 l14 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l14) (capacity v1 c1)
   goals met: 6 of 14
25. (drive v1 l14 l11)
   deleted: (at v1 l14)
   added: (at v1 l11)
   goals met: 6 of 14
26. (pick-up v1 l11 p7 c0 c1)
   deleted: (at p7 l11) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 14
27. (drive v1 l11 l2)
   deleted: (at v1 l11)
   added: (at v1 l2)
   goals met: 6 of 14
28. (drop v1 l2 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l2) (capacity v1 c1)
   goals met: 7 of 14
29. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 7 of 14
30. (pick-up v1 l12 p8 c0 c1)
   deleted: (at p8 l12) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 14
31. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 7 of 14
32. (drop v1 l2 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l2) (capacity v1 c1)
   goals met: 8 of 14
33. (drive v1 l2 l14)
   deleted: (at v1 l2)
   added: (at v1 l14)
   goals met: 8 of 14
34. (pick-up v1 l14 p9 c0 c1)
   deleted: (at p9 l14) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 14
35. (drive v1 l14 l12)
   deleted: (at v1 l14)
   added: (at v1 l12)
   goals met: 8 of 14
36. (drop v1 l12 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l12) (capacity v1 c1)
   goals met: 9 of 14
37. (drive v1 l12 l13)
   deleted: (at v1 l12)
   added: (at v1 l13)
   goals met: 9 of 14
38. (pick-up v1 l13 p10 c0 c1)
   deleted: (at p10 l13) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 14
39. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 9 of 14
40. (drop v1 l5 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l5) (capacity v1 c1)
   goals met: 10 of 14
41. (drive v1 l5 l14)
   deleted: (at v1 l5)
   added: (at v1 l14)
   goals met: 10 of 14
42. (pick-up v1 l14 p11 c0 c1)
   deleted: (at p11 l14) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 14
43. (drive v1 l14 l7)
   deleted: (at v1 l14)
   added: (at v1 l7)
   goals met: 10 of 14
44. (drop v1 l7 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l7) (capacity v1 c1)
   goals met: 11 of 14
45. (drive v1 l7 l10)
   deleted: (at v1 l7)
   added: (at v1 l10)
   goals met: 11 of 14
46. (pick-up v1 l10 p12 c0 c1)
   deleted: (at p12 l10) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 14
47. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 11 of 14
48. (drop v1 l13 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l13) (capacity v1 c1)
   goals met: 12 of 14
49. (drive v1 l13 l7)
   deleted: (at v1 l13)
   added: (at v1 l7)
   goals met: 12 of 14
50. (pick-up v1 l7 p13 c0 c1)
   deleted: (at p13 l7) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 12 of 14
51. (drive v1 l7 l12)
   deleted: (at v1 l7)
   added: (at v1 l12)
   goals met: 12 of 14
52. (drop v1 l12 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l12) (capacity v1 c1)
   goals met: 13 of 14
53. (drive v1 l12 l13)
   deleted: (at v1 l12)
   added: (at v1 l13)
   goals met: 13 of 14
54. (pick-up v1 l13 p14 c0 c1)
   deleted: (at p14 l13) (capacity v1 c1)
   added: (in p14 v1) (capacity v1 c0)
   goals met: 13 of 14
55. (drive v1 l13 l12)
   deleted: (at v1 l13)
   added: (at v1 l12)
   goals met: 13 of 14
56. (drop v1 l12 p14 c0 c1)
   deleted: (in p14 v1) (capacity v1 c0)
   added: (at p14 l12) (capacity v1 c1)
   goals met: 14 of 14
